#include <iostream>
#include <vector>
#include <string>

int main() {
    std::string s = "YX _0__1__2__3__4__5_\n"
                    "0  |__|__|__|__|__|__|\n"
                    "1  |L*|__|__|__|__|+M|\n"
                    "2  |T*|__|__|__|__|__|\n"
                    "3  |##|__|__|+T|__|##|\n"
                    "4  |__|__|M*|__|__|__|\n"
                    "5  |__|__|__|__|__|+L|\n"
                    "6  |__|__|__|__|__|__|\n";


    std::string a = "YX _0__1__2__3__4__5_\n"
                    "0  |__|__|__|__|__|__|\n"
                    "1  |__|__|T+|__|__|__|\n"
                    "2  |__|__|__|__|__|__|\n"
                    "3  |##|__|__|__|__|##|\n"
                    "4  |__|__|__|__|__|__|\n"
                    "5  |__|__|__|__|__|__|\n"
                    "6  |__|__|__|__|__|__|\n";

    /*
     * TODO: Идея отрисовки поля!
     * Пусть танк имеет координаты (x, y). Поле будет из себя представлять вектор строк.
     * В таком случае в строке вектора с индексом (x + 1) в позициях (y + 2*y + 1) и (y + 2*y + 2) нужно будет размещать танк.
     *
     */
    return 0;
}
